{
  "backend/main.mo": "Main Motoko actor implementing an e-commerce backend with product management, customer registration, cart operations, order processing with Stripe payment integration, blob storage for images, and role-based access control.",
  "feature_evidence.json": "Feature evidence report documenting that OKLCH color system variables from frontend/index.css are properly applied across components, with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing routing, landing page sections, OKLCH/HSL color system implementation, component structure, and vegetarian product focus.",
  "frontend/index.css": "Global CSS with HSL color system variables (converted from OKLCH), Tailwind layers, typography hierarchy, section spacing utilities, and print-specific styles for KOT printing.",
  "frontend/index.html": "HTML entry point with SEO meta tags for Farmgrew Chennai, Inter font preload, and root div for React mounting.",
  "frontend/src/App.tsx": "Root React component with React Query provider, client-side routing logic for all pages (landing, shop, cart, orders, admin, KOT, payment), and authentication/authorization guards.",
  "frontend/src/components/admin/AdminCredentialsRotation.tsx": "Admin credentials rotation form component with validation, password confirmation, success/error alerts, and mutation hook for updating username and password.",
  "frontend/src/components/admin/AdminManagement.tsx": "Admin management interface for granting admin privileges via Internet Identity principals, with principal validation, role checking, and clipboard copy functionality.",
  "frontend/src/components/admin/AdminResetCard.tsx": "Provides a UI card for resetting admin configuration with confirmation dialog, warning alerts, and instructions for manual canister redeployment via dfx commands.",
  "frontend/src/components/admin/InitialAdminSetupForm.tsx": "Form component for setting up initial admin credentials with validation, including username (min 3 chars) and password (min 8 chars) fields, with automatic page reload on success.",
  "frontend/src/components/admin/KOTView.tsx": "Displays a printable Kitchen Order Ticket (KOT) with order details, customer information, items list, payment method, and formatted timestamps.",
  "frontend/src/components/auth/AdminLoginForm.tsx": "Admin authentication form with username/password fields, validation, error handling, and integration with the admin authentication hook.",
  "frontend/src/components/auth/LoginButton.tsx": "Toggle button component for Internet Identity login/logout with loading states and query cache clearing on logout.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Higher-order component that guards admin routes by checking authentication, admin configuration status, and admin privileges, showing appropriate forms or loading states.",
  "frontend/src/components/auth/RequireAuth.tsx": "Authentication guard component that redirects unauthenticated users to a login prompt with Internet Identity integration and navigation options.",
  "frontend/src/components/auth/RequireRegistration.tsx": "A guard component that checks if a user has completed their customer profile registration, showing a prompt to complete registration if not, or rendering children if profile exists.",
  "frontend/src/components/landing/About.tsx": "Displays the 'Why Choose Farmgrew?' section with three feature cards (Fresh & Quality, Save Time, Hygienic Processing) and an about text emphasizing pure vegetarian products.",
  "frontend/src/components/landing/Categories.tsx": "Empty file with no content.",
  "frontend/src/components/landing/CategoryCard.tsx": "Empty file with no content.",
  "frontend/src/components/landing/DietPlansSection.tsx": "Renders a grid of three pure vegetarian diet plan cards (balanced, high-protein, low-sugar) with benefits, focus areas, and selection functionality.",
  "frontend/src/components/landing/Footer.tsx": "Site footer with Farmgrew branding, quick navigation links to sections, contact info for Chennai, and attribution to caffeine.ai.",
  "frontend/src/components/landing/Hero.tsx": "Landing page hero section with headline, CTA buttons for shopping and personalized recommendations, and a hero illustration image.",
  "frontend/src/components/landing/NutritionCalculatorSection.tsx": "Interactive nutrition calculator that lets users build a basket of vegetarian items, calculates nutritional totals, pre-fills based on selected diet plan, and integrates with backend cart functionality.",
  "frontend/src/components/landing/RecommendationsSection.tsx": "Displays an AI-powered recommendations section with interactive goal and dietary preference selection, showing personalized vegetarian product suggestions based on user choices and selected diet plans.",
  "frontend/src/components/landing/ServiceArea.tsx": "Shows service area information with two cards: one displaying Chennai as the currently served city and another announcing expansion to more cities.",
  "frontend/src/components/landing/TopNav.tsx": "Main navigation component with sticky header, logo, desktop/mobile menus, authentication state, cart badge, and navigation links for both landing page sections and shop pages.",
  "frontend/src/components/layout/Container.tsx": "Simple wrapper component that provides consistent max-width and horizontal padding for page content.",
  "frontend/src/components/orders/OrderTrackingTimeline.tsx": "Displays order tracking history as a vertical timeline with status icons, timestamps, and notes for each tracking entry.",
  "frontend/src/components/shop/CategoryFilter.tsx": "Renders a horizontal tabs component for filtering products by category with active state styling.",
  "frontend/src/components/shop/ProductCard.tsx": "Product card component displaying image, name, description, price, and add-to-cart button with authentication check and image fallback handling.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminAuthorization.ts": "Mutation hook for authenticating admin users with username/password, mapping backend errors to user-friendly messages.",
  "frontend/src/hooks/useAdminCredentials.ts": "Mutation hook for updating admin credentials with error handling and query invalidation on success.",
  "frontend/src/hooks/useAdminManagement.ts": "Provides React Query hooks for admin role management including listing admins, granting/revoking admin roles, and checking user roles via the backend actor.",
  "frontend/src/hooks/useAdminProducts.ts": "Exports hooks for admin product operations (CRUD) and admin status checking, including creating, updating, deleting products and uploading product images.",
  "frontend/src/hooks/useAdminReset.ts": "Provides a mutation hook to reset admin configuration, though it currently throws an error indicating a canister upgrade is required for the actual reset.",
  "frontend/src/hooks/useCart.ts": "Exports React Query hooks for cart operations including fetching the cart, adding/updating/removing items, and clearing the cart for authenticated users.",
  "frontend/src/hooks/useCustomer.ts": "Provides hooks for customer profile management including fetching customer profile by principal and registering new customers with name, phone, and pickup address.",
  "frontend/src/hooks/useInitialAdminSetup.ts": "Exports hooks to check if admin credentials are configured and to set initial admin credentials during first-time setup.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider with login/logout functionality, identity management, and AuthClient configuration.",
  "frontend/src/hooks/useKOT.ts": "Provides a hook to fetch enriched Kitchen Order Ticket (KOT) data including order details, customer information, and product details for each order item.",
  "frontend/src/hooks/useOrders.ts": "Exports hooks for order management including fetching user orders, placing orders with payment method and pickup time, marking orders as paid, and admin order listing.",
  "frontend/src/hooks/useProducts.ts": "Provides React Query hooks for fetching products by optional category filter and fetching individual products by ID.",
  "frontend/src/hooks/useStripe.ts": "React hooks for Stripe integration including checking configuration status, setting configuration, creating checkout sessions, and polling session status with automatic refetch intervals.",
  "frontend/src/index.css": "Global CSS with Tailwind configuration, HSL-based design tokens for light/dark themes (green/yellow brand colors), typography hierarchy, spacing utilities, and print-optimized styles for KOT receipts.",
  "frontend/src/lib/dietPlans.ts": "Defines diet plan types and data for three plans (Balanced Nutrition, High Protein, Low Sugar) with descriptions, benefits, and focus areas.",
  "frontend/src/lib/nutritionData.ts": "Nutrition database with per-100g macros for fruits, vegetables, proteins, legumes, and grains, plus a function to calculate totals from basket items by quantity.",
  "frontend/src/lib/productImage.ts": "Utility functions to generate product image URLs from normalized product names and provide SVG fallback placeholders when images are missing.",
  "frontend/src/lib/recommendationsData.ts": "Defines goal and dietary preference types with a recommendation database that suggests food items based on user goals (balanced, weight-loss, muscle-gain, energy-boost) and filters by dietary preferences.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page with tabs for product management (CRUD operations with image upload), Stripe configuration, order management (mark as paid), admin user management, credential rotation, and system reset functionality.",
  "frontend/src/pages/CartPage.tsx": "Displays shopping cart with item management (quantity update, removal), calculates totals, and handles checkout flow with Stripe or Cash on Delivery payment methods.",
  "frontend/src/pages/KOTPage.tsx": "Displays a Kitchen Order Ticket (KOT) for a specific order ID extracted from the URL, with print-friendly layout and back navigation to admin panel.",
  "frontend/src/pages/OrderDetailsPage.tsx": "Shows detailed order information including status timeline, payment method/status, order items with product images, and formatted pricing for a specific order ID.",
  "frontend/src/pages/OrdersPage.tsx": "Lists all user orders with status badges, payment method indicators, and navigation to individual order details; shows empty state when no orders exist.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Handles failed Stripe payment flow by displaying error message, order details, and providing navigation options to retry payment, view orders, or continue shopping.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Processes successful Stripe payment by verifying session status, marking order as paid with amount details, and displaying confirmation with navigation to order details.",
  "frontend/src/pages/RegisterPage.tsx": "Customer registration page with form validation for name, phone number, and pickup address. Displays success state with navigation options after profile save.",
  "frontend/src/pages/ShopPage.tsx": "Product browsing page with category filtering, loading states, and empty state handling. Displays products in a grid using ProductCard components.",
  "frontend/src/router/navigation.ts": "Client-side navigation utilities using browser history API. Provides navigate function and route matching helper.",
  "frontend/src/router/usePathname.ts": "React hook that tracks current pathname and updates on browser navigation events (popstate).",
  "frontend/src/sections/LandingPage.tsx": "Main landing page component composing Hero, Recommendations, Nutrition Calculator, Diet Plans, Service Area, About sections with shared state for selected diet plan.",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing utilities supporting both query strings and hash-based routing, with sessionStorage persistence for parameters like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color system using CSS variables (HSL format), custom shadows, animations, and design tokens for the application theme.",
  "project_state.json": "Project metadata tracking known issue of missing colors on buttons and boxes, with pending fix requests to restore OKLCH-based color system styling."
}