{
  "backend/main.mo": "Defines product, customer, cart, and order types with storage, access control, and image mappings, forming the main backend actor for product management and ordering.",
  "feature_evidence.json": "Lists feature evidence entries linking feature IDs to modified frontend files, associated components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for numerous frontend files describing their structure, purpose, and UI behavior.",
  "frontend/index.css": "Defines global Tailwind base styles and OKLCH color variables for light and dark themes with layout-wide styling.",
  "frontend/index.html": "HTML entry point setting metadata, fonts, and bootstrapping the React app via main.tsx.",
  "frontend/src/App.tsx": "Configures React Query, Internet Identity provider, and client-side routing with authentication and admin guards.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button wired to Internet Identity with loading states and automatic query cache clearing.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Protects admin pages by checking admin status and showing an access-denied screen for unauthorized users.",
  "frontend/src/components/auth/RequireAuth.tsx": "Guards pages that require authentication, prompting users to log in via Internet Identity if not signed in.",
  "frontend/src/components/auth/RequireRegistration.tsx": "Gates children behind a customer profile check, showing a loader or registration prompt if missing.",
  "frontend/src/components/landing/About.tsx": "Displays an About section with features and descriptive text explaining Farmgrew’s value.",
  "frontend/src/components/landing/Categories.tsx": "Empty file placeholder for a categories section.",
  "frontend/src/components/landing/CategoryCard.tsx": "Empty file placeholder for a category card component.",
  "frontend/src/components/landing/DietPlansSection.tsx": "Renders a diet-plans landing section with icons, images, and selectable plan cards sourced from dietPlans.",
  "frontend/src/components/landing/Footer.tsx": "Provides footer layout with branding, quick navigation links, and contact info.",
  "frontend/src/components/landing/Hero.tsx": "Hero section with marketing text, calls-to-action, and scroll/navigation helpers.",
  "frontend/src/components/landing/NutritionCalculatorSection.tsx": "Nutrition calculator panel with diet-plan presets, basket item editing, product add-to-cart logic, and totals computation.",
  "frontend/src/components/landing/RecommendationsSection.tsx": "Displays interactive AI-powered product recommendations based on selected goals and dietary preferences, updating automatically when a plan is chosen.",
  "frontend/src/components/landing/ServiceArea.tsx": "Shows service availability with cards highlighting current coverage in Chennai and future expansion plans.",
  "frontend/src/components/landing/TopNav.tsx": "Implements the top navigation bar with routing, section scrolling, mobile menu handling, identity-aware actions, and cart count display.",
  "frontend/src/components/layout/Container.tsx": "Provides a responsive layout wrapper that centers content with consistent horizontal padding.",
  "frontend/src/components/shop/CategoryFilter.tsx": "Renders a tab-based category selector allowing users to filter shop items by category.",
  "frontend/src/components/shop/ProductCard.tsx": "Displays product details with image fallbacks and supports adding items to the cart, redirecting unauthenticated users to registration.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminProducts.ts": "Provides admin-focused product queries and mutations for listing, creating, updating, deleting, and uploading images.",
  "frontend/src/hooks/useCart.ts": "Exposes cart queries and mutations to manage cart contents using the authenticated actor.",
  "frontend/src/hooks/useCustomer.ts": "React Query hooks for fetching and registering customer profiles via an actor, with cache invalidation on registration.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication, including login, logout, and state handling.",
  "frontend/src/hooks/useOrders.ts": "Hooks to list orders, fetch a single order, and place new orders with automatic cache updates.",
  "frontend/src/hooks/useProducts.ts": "Hooks for querying products or a single product by ID through the actor API.",
  "frontend/src/index.css": "Tailwind CSS base styles and theme variables for light and dark modes with custom utilities.",
  "frontend/src/lib/dietPlans.ts": "Static definitions of several diet plans with descriptions, benefits, and focus areas.",
  "frontend/src/lib/nutritionData.ts": "Nutrition data for various foods plus a utility to calculate total nutrients for a basket of items.",
  "frontend/src/lib/productImage.ts": "Utility to derive product image URLs from product names with a fallback SVG image.",
  "frontend/src/lib/recommendationsData.ts": "Goal- and preference-based recommendation data with a function to filter and generate personalized recommendations.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/AdminPage.tsx": "Admin interface for viewing, creating, editing, and deleting products with image upload, validation, and modal dialogs.",
  "frontend/src/pages/CartPage.tsx": "Displays cart items, allows quantity updates and removal, calculates totals, and submits orders.",
  "frontend/src/pages/OrderDetailsPage.tsx": "Shows details of a specific order including status, items, and timestamps, with loading and not‑found states.",
  "frontend/src/pages/OrdersPage.tsx": "Lists all user orders with status, totals, and navigation to individual order details.",
  "frontend/src/pages/RegisterPage.tsx": "Handles customer registration or profile update with form submission and success confirmation.",
  "frontend/src/pages/ShopPage.tsx": "Displays products with category filtering, loading/error states, and product grid rendering.",
  "frontend/src/router/navigation.ts": "Provides simple client-side navigation using history API and checks if a route is active.",
  "frontend/src/router/usePathname.ts": "React hook that tracks and returns the current pathname via popstate events.",
  "frontend/src/sections/LandingPage.tsx": "Renders the main landing page layout and sections, managing a selected diet plan state.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL params, persisting them in sessionStorage, and clearing them from URL or session.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theming, colors, typography, and custom utilities.",
  "project_state.json": "Stores project state, including admin UI feature requirements and access restrictions."
}