{
  "backend/main.mo": "Main actor implementing product, customer, cart, and order types with access control, image storage mixin, and in-memory maps for catalog and ordering workflows.",
  "backend/migration.mo": "Migration module converting old product records to new product format with description and image fields, preserving product IDs and nextProductId.",
  "feature_evidence.json": "Report listing implemented features, associated frontend files, components, and test coverage for admin product management and data persistence.",
  "frontend-file-summaries.txt": "Pre-generated summaries of many frontend files describing UI components, pages, configuration, and styling.",
  "frontend/index.css": "Global Tailwind-based styles defining color tokens, dark mode variables, and base theming.",
  "frontend/index.html": "HTML entry point configuring metadata, fonts, and mounting the root React application.",
  "frontend/src/App.tsx": "Main React router and providers setup handling app-wide routing, authentication gates, and page selection.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and error handling.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Authorization gate that checks admin status and shows loading or access-denied UI before rendering admin content.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wrapper that checks Internet Identity authentication and shows loading or login prompts before rendering children.",
  "frontend/src/components/auth/RequireRegistration.tsx": "Ensures a user has a completed customer profile, displaying loading or registration prompts before rendering children.",
  "frontend/src/components/landing/About.tsx": "Renders the About section with features and descriptive content about Farmgrew’s offerings.",
  "frontend/src/components/landing/Categories.tsx": "Empty file with no implementation.",
  "frontend/src/components/landing/CategoryCard.tsx": "Empty file with no implementation.",
  "frontend/src/components/landing/DietPlansSection.tsx": "Displays selectable vegetarian diet plans with icons, benefits, and descriptions using data from dietPlans.",
  "frontend/src/components/landing/Footer.tsx": "Footer section with branding, quick navigation links, contact info, and scroll-to-section behavior.",
  "frontend/src/components/landing/Hero.tsx": "Hero section with headline, call-to-action buttons, decorative visuals, and scroll-to-section functionality.",
  "frontend/src/components/landing/NutritionCalculatorSection.tsx": "Provides a nutrition calculator UI that manages a basket of food items, pre-fills based on diet plans, computes totals, and integrates with backend products and cart actions.",
  "frontend/src/components/landing/RecommendationsSection.tsx": "Displays AI-driven product recommendations based on selected goals and dietary preferences, updating automatically when linked diet plans change.",
  "frontend/src/components/landing/ServiceArea.tsx": "Shows current and upcoming service locations with styled cards highlighting Chennai and future expansion.",
  "frontend/src/components/landing/TopNav.tsx": "Implements the top navigation bar with routing, scrolling to sections, cart count display, admin links, and responsive mobile menu handling.",
  "frontend/src/components/layout/Container.tsx": "Simple layout wrapper that centers content with responsive horizontal padding.",
  "frontend/src/components/shop/CategoryFilter.tsx": "Renders a tab-based category filter allowing users to switch product categories.",
  "frontend/src/components/shop/ProductCard.tsx": "Displays product details with image fallback logic and handles add-to-cart actions with authentication checks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor that updates with identity changes and refreshes dependent queries accordingly.",
  "frontend/src/hooks/useAdminProducts.ts": "Provides React Query hooks for admin product actions including listing, creating, updating, deleting, and image uploads.",
  "frontend/src/hooks/useCart.ts": "Implements cart management hooks for fetching the cart and modifying items via actor API calls.",
  "frontend/src/hooks/useCustomer.ts": "Contains hooks to fetch the customer profile and register new customers using actor methods.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines an Internet Identity context and provider for authentication with login, logout, and identity loading logic.",
  "frontend/src/hooks/useOrders.ts": "Provides hooks to fetch user orders, fetch a specific order, and place new orders while invalidating related queries.",
  "frontend/src/hooks/useProducts.ts": "Exports hooks to fetch product lists or individual products using the actor API.",
  "frontend/src/index.css": "Tailwind CSS config defining design tokens, dark mode variables, and utility classes.",
  "frontend/src/lib/dietPlans.ts": "Defines static diet plan data with descriptions, benefits, and focus areas.",
  "frontend/src/lib/nutritionData.ts": "Provides nutrition item definitions, sample data, and a function to calculate macro totals for basket items.",
  "frontend/src/lib/productImage.ts": "Generates product image URLs based on normalized names and provides a fallback SVG image.",
  "frontend/src/lib/recommendationsData.ts": "Defines nutrition goals, dietary preferences, recommendation types, and a database plus filtering logic for generating item recommendations.",
  "frontend/src/main.tsx": "Sets up the React app root with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AdminPage.tsx": "Provides an admin interface to create, edit, and delete products with image upload, form validation, and product listing.",
  "frontend/src/pages/CartPage.tsx": "Displays the user's cart, allows quantity updates and item removal, calculates totals, and submits orders.",
  "frontend/src/pages/OrderDetailsPage.tsx": "Fetches and displays details for a specific order, including items, status, and timestamps.",
  "frontend/src/pages/OrdersPage.tsx": "Lists all user orders with status, date, and total, and links to individual order detail pages.",
  "frontend/src/pages/RegisterPage.tsx": "Registration and profile update page that loads customer data, submits registration, and shows success or loading states.",
  "frontend/src/pages/ShopPage.tsx": "Displays products with category filtering, loading/error handling, and product grid rendering.",
  "frontend/src/router/navigation.ts": "Provides simple client-side navigation and route activity checking using history API.",
  "frontend/src/router/usePathname.ts": "React hook that tracks and updates the current pathname on popstate events.",
  "frontend/src/sections/LandingPage.tsx": "Landing page assembling hero, recommendations, calculator, plans, service area, and about sections.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending theme colors, fonts, container settings, and plugins.",
  "project_state.json": "Project metadata describing app requirements, admin module goals, and feature implementation state."
}