{
  "backend/main.mo": "Defines the main backend canister with product, customer, cart, and order types plus storage, authorization, Stripe config, and in-memory maps for runtime data.",
  "backend/migration.mo": "Provides a migration function that resets stored admin credentials to null while preserving other state.",
  "feature_evidence.json": "Feature evidence report describing a frontend update to the admin setup flow with related files, components, and tests.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files describing layout, components, styling, and feature sections.",
  "frontend/index.css": "Global Tailwind base/theme variables and dark-mode definitions for colors, borders, and layout styling.",
  "frontend/index.html": "HTML entry point defining metadata, fonts, and root mount point for the frontend app.",
  "frontend/src/App.tsx": "Top-level app router wiring routes for shop, auth, registration, orders, payments, and admin within providers.",
  "frontend/src/components/admin/AdminCredentialsRotation.tsx": "Admin UI form enabling username/password updates with validation, success alerting, and mutation handling.",
  "frontend/src/components/admin/AdminManagement.tsx": "Component for viewing the current principal, validating principal IDs, checking user roles, and granting admin privileges.",
  "frontend/src/components/admin/AdminResetCard.tsx": "UI card that warns about and initiates an admin reset process requiring confirmation and a backend redeployment.",
  "frontend/src/components/admin/InitialAdminSetupForm.tsx": "Form for setting initial admin username and password, including validation and post‑setup reload logic.",
  "frontend/src/components/auth/AdminLoginForm.tsx": "Admin login form that validates credentials and triggers authentication via a backend hook.",
  "frontend/src/components/auth/LoginButton.tsx": "Button that handles Internet Identity login/logout states with loading feedback.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Gatekeeper component that shows admin setup, admin login, or protected content based on admin status and configuration.",
  "frontend/src/components/auth/RequireAuth.tsx": "Ensures the user is authenticated with Internet Identity, showing a login prompt if not.",
  "frontend/src/components/auth/RequireRegistration.tsx": "Wrapper that checks customer profile; shows loading or prompts registration before rendering children.",
  "frontend/src/components/landing/About.tsx": "Renders an About section with key features and a description of Farmgrew's vegetarian offerings.",
  "frontend/src/components/landing/Categories.tsx": "Empty file placeholder for a categories section.",
  "frontend/src/components/landing/CategoryCard.tsx": "Empty file placeholder for a category card component.",
  "frontend/src/components/landing/DietPlansSection.tsx": "Displays selectable vegetarian diet plans with icons, benefits, focus areas, and a select button.",
  "frontend/src/components/landing/Footer.tsx": "Footer with brand info, quick links with smooth scrolling, and contact details.",
  "frontend/src/components/landing/Hero.tsx": "Landing hero section with headline, call‑to‑action buttons, and decorative visuals.",
  "frontend/src/components/landing/NutritionCalculatorSection.tsx": "Nutrition calculator that manages basket items, integrates products and cart actions, and pre-fills based on selected diet plan.",
  "frontend/src/components/landing/RecommendationsSection.tsx": "Interactive AI recommendations UI that updates goals and preferences based on selected plan and displays personalized suggestions.",
  "frontend/src/components/landing/ServiceArea.tsx": "Renders a section showing current and upcoming service locations using styled cards.",
  "frontend/src/components/landing/TopNav.tsx": "Navigation bar handling routing, scroll-to-section behavior, cart count, and responsive mobile menu.",
  "frontend/src/components/layout/Container.tsx": "Wrapper component providing consistent horizontal padding and centered layout.",
  "frontend/src/components/orders/OrderTrackingTimeline.tsx": "Displays an order's status history as a timeline with icons, timestamps, and notes.",
  "frontend/src/components/shop/CategoryFilter.tsx": "Category selection tabs allowing users to filter products by category.",
  "frontend/src/components/shop/ProductCard.tsx": "Product display card with image fallback logic, price, description, and add‑to‑cart handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useAdminAuthorization.ts": "Mutation hook to authenticate an admin and map backend errors to user‑friendly messages.",
  "frontend/src/hooks/useAdminCredentials.ts": "Mutation hook for updating admin credentials with error mapping and cache invalidation.",
  "frontend/src/hooks/useAdminManagement.ts": "Hooks for listing, granting, revoking, and checking admin roles via actor calls with react-query.",
  "frontend/src/hooks/useAdminProducts.ts": "Admin-only hooks for managing products, including listing, creating, updating, deleting, and uploading images.",
  "frontend/src/hooks/useAdminReset.ts": "Provides a mutation to trigger admin configuration reset, currently limited to throwing a redeploy-required error.",
  "frontend/src/hooks/useCart.ts": "Cart management hooks for fetching, adding, updating, removing, and clearing cart items.",
  "frontend/src/hooks/useCustomer.ts": "Hooks for retrieving and registering customer profiles tied to authenticated identities.",
  "frontend/src/hooks/useInitialAdminSetup.ts": "Hooks to check admin setup state and set initial admin credentials with validation and error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hooks for managing Internet Identity authentication and login state.",
  "frontend/src/hooks/useOrders.ts": "Hooks for listing orders, fetching orders by ID, placing orders, and marking orders as paid.",
  "frontend/src/hooks/useProducts.ts": "Hooks to fetch product lists by category and retrieve individual products by ID.",
  "frontend/src/hooks/useStripe.ts": "Hooks for Stripe configuration, creating checkout sessions, and polling session status.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes plus utility classes for spacing and text balance.",
  "frontend/src/lib/dietPlans.ts": "Exports diet plan types and a list of predefined diet plans with descriptions, benefits, and focus areas.",
  "frontend/src/lib/nutritionData.ts": "Provides nutrition item data, related interfaces, and a function to calculate total nutrition values for a basket.",
  "frontend/src/lib/productImage.ts": "Generates normalized product image paths and provides an inline SVG fallback image.",
  "frontend/src/lib/recommendationsData.ts": "Defines goals, dietary preferences, recommendation data, and logic to filter recommendations based on user preferences.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, rendering the root component.",
  "frontend/src/pages/AdminPage.tsx": "Implements a full admin interface for managing products and Stripe configuration with forms, dialogs, and CRUD operations.",
  "frontend/src/pages/CartPage.tsx": "Displays and manages the shopping cart, handles quantity updates, removal, total calculation, and initiates Stripe checkout.",
  "frontend/src/pages/OrderDetailsPage.tsx": "Displays detailed info for a single order, including items, status, payment info, and timeline, with loading and not-found states.",
  "frontend/src/pages/OrdersPage.tsx": "Lists all user orders with status, payment indicators, and navigation to individual order pages.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows payment failure details using Stripe session status and offers navigation to retry or view orders.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Validates Stripe payment success, marks the order as paid, and lets users navigate to the order or shop.",
  "frontend/src/pages/RegisterPage.tsx": "Handles customer registration or profile update with form inputs, loading, and success state.",
  "frontend/src/pages/ShopPage.tsx": "Displays product catalog with category filtering, loading/error states, and navigation to product details or admin.",
  "frontend/src/router/navigation.ts": "Provides functions to push a new path to history and check if a route is active.",
  "frontend/src/router/usePathname.ts": "React hook that tracks and returns the current URL pathname using popstate events.",
  "frontend/src/sections/LandingPage.tsx": "Landing page component composing multiple sections and managing selected diet plan state.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and clearing them from URL or storage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, typography, and plugin setup.",
  "project_state.json": "Project state file describing schema version, issues, features, and new feature requests related to admin reset and setup."
}