{
  "kind": "build_request",
  "title": "Create visible Admin UI for product management and restrict access to grandzbee@gmail.com (via Internet Identity principal allowlist)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Make the admin area discoverable in the UI by adding a clearly visible navigation entry that routes to /admin, even when the current user is not an admin (the page must still be protected by the admin guard).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Yes create the admin UI. The credentails should be Google account of grandzbee@gmail.com"
        ]
      },
      "acceptanceCriteria": [
        "Top navigation includes an \"Admin\" entry that navigates to /admin.",
        "If a non-admin user clicks \"Admin\", they are routed to /admin and shown an access denied screen (no admin content is rendered).",
        "If an admin user clicks \"Admin\", they are routed to /admin and the admin product management UI is rendered."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Enforce admin access based on an allowlist of Internet Identity principals, and provide a backend mechanism for a canister controller to add the admin principal corresponding to the Internet Identity that is linked to Google account grandzbee@gmail.com.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "The credentails should be Google account of grandzbee@gmail.com"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes an admin-check function used by the frontend (e.g., the existing actor.isCallerAdmin() call used by useIsAdmin returns true only for allowlisted principals).",
        "Backend provides a controller-only method to add an admin principal to the allowlist.",
        "Once the principal for the Internet Identity linked to grandzbee@gmail.com is added to the allowlist, that identity is recognized as admin (admin check returns true) and can perform product CRUD.",
        "Non-allowlisted principals cannot call admin-only product APIs (create/update/delete/listAll/uploadProductImage) and receive an authorization error."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update user-facing admin-access messaging to reflect the actual authentication model: users must sign in with Internet Identity, and only the Internet Identity that is linked to Google account grandzbee@gmail.com is permitted as admin.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "The credentails should be Google account of grandzbee@gmail.com"
        ]
      },
      "acceptanceCriteria": [
        "The /admin access denied UI includes English text indicating that admin access is restricted to the Internet Identity linked to Google account grandzbee@gmail.com.",
        "No UI claims that direct Google OAuth login is supported; wording references Internet Identity and linking to the specified Google account."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not modify any files under frontend/src/components/ui (compose existing UI components only).",
    "Do not modify frontend immutable paths listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Only Internet Identity authentication is supported; do not add Google OAuth or third-party authentication flows."
  ],
  "nonGoals": [
    "Implementing Google OAuth sign-in, reading email addresses from an identity provider, or any third-party auth integration.",
    "Adding additional admin modules beyond product management CRUD (e.g., order management, user management) unless explicitly requested.",
    "Real-time updates or websocket-based admin features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}