{
  "kind": "build_request",
  "title": "Fix missing colors on buttons and boxes",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Restore background colors and border colors to all button elements across the application. Buttons should render with visible colors matching the OKLCH color system defined in the index.css file.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-latest"
        ],
        "quotes": [
          "All the boxes and buttons are blank without colours"
        ]
      },
      "acceptanceCriteria": [
        "All buttons display with appropriate background colors",
        "Button hover states show visible color changes",
        "Button text has sufficient contrast against backgrounds"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Restore background colors and border colors to all card and box components (including product cards, diet plan cards, recommendation sections, and form containers). All boxes should render with visible styling matching the design system.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-latest"
        ],
        "quotes": [
          "All the boxes and buttons are blank without colours"
        ]
      },
      "acceptanceCriteria": [
        "Product cards display with visible borders and backgrounds",
        "Diet plan selection cards show proper styling",
        "Health goal selection buttons render with visible colors",
        "Form containers and input boxes have visible borders"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the OKLCH color system variables defined in frontend/index.css are properly applied throughout all components. Verify that CSS custom properties (--color-primary, --color-surface, etc.) are correctly referenced in component styles.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-latest"
        ]
      },
      "acceptanceCriteria": [
        "All components correctly reference CSS custom properties",
        "Both light and dark mode color variables are functional",
        "No hardcoded color values override the design system"
      ]
    }
  ],
  "constraints": [
    "Do not modify the OKLCH color definitions in frontend/index.css",
    "Maintain existing component structure and functionality",
    "Preserve all existing hover and interaction states"
  ],
  "nonGoals": [
    "Changing the color palette or design system",
    "Redesigning component layouts",
    "Adding new UI components"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}