{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix initial admin setup to use backend initial-setup API and remove circular lockout messaging",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Update initial admin setup flow to call the backend initial-setup API and refresh admin state after success.",
      "acceptanceCriteria": [
        "On the Initial Admin Setup screen, submitting valid username/password/confirm password calls the backend initial-setup API and succeeds when the backend is in the reset/fresh state.",
        "After success, the UI shows the existing success state and a subsequent reload allows access to the admin dashboard for that same Internet Identity principal.",
        "If credentials are already configured, the UI shows an actionable error (e.g., instructing the user to use the admin login form) and does not claim that reset requires contacting an administrator.",
        "React Query caches related to admin state (e.g., isAdminConfigured, isAdmin) are invalidated/refetched appropriately after setup success."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useInitialAdminSetup.ts",
          "operation": "modify",
          "description": "Replace the current workaround logic with direct calls to backend capabilities: use the backend isAdminConfigured() for configuration detection, and call initializeAdminAccess(username, password) for initial admin setup. Update error mapping to show an actionable message when setup is disallowed because credentials already exist. Invalidate/refetch React Query caches for admin state (e.g., ['isAdminConfigured'], ['isAdmin']) after successful setup. Use the authorization component’s Internet Identity + role-based access control flow as already wired in the app; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/InitialAdminSetupForm.tsx",
          "operation": "modify",
          "description": "Adjust the Initial Admin Setup UI to align with the new initializeAdminAccess-based flow: ensure submission uses the updated hook, remove/avoid the circular-lockout copy that tells users to contact an administrator after a reset, and present actionable guidance when credentials are already configured (e.g., prompt to use the admin login form). Keep the existing success state and reload behavior, ensuring it triggers after caches are invalidated/refetched. Compose existing shadcn-ui components (Card, Alert, Button, Input) without modifying immutablePaths; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}