{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Discoverable protected admin route and correct Internet Identity admin messaging",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make /admin discoverable by always showing an Admin navigation entry while keeping the /admin page protected by the admin guard.",
      "acceptanceCriteria": [
        "Top navigation includes an \"Admin\" entry that navigates to /admin.",
        "If a non-admin user clicks \"Admin\", they are routed to /admin and shown an access denied screen (no admin content is rendered).",
        "If an admin user clicks \"Admin\", they are routed to /admin and the admin product management UI is rendered."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/landing/TopNav.tsx",
          "operation": "modify",
          "description": "Remove the conditional rendering that hides the Admin link for non-admin users; always render the \"Admin\" navigation entry (desktop + mobile) routing to /admin, while optionally using the existing admin state (useIsAdmin) only for subtle UI hints (not for hiding). Use existing shadcn-ui primitives already imported (e.g., Button/Badge styling patterns) and existing routing helpers. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Confirm /admin remains routed through RequireAuth + RequireAdmin to ensure the admin guard still protects the AdminPage even though the navigation entry is visible to everyone; adjust only if needed to preserve the guard wiring (no new routes)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update /admin access denied messaging to reflect Internet Identity sign-in and that admin access is restricted to the Internet Identity linked to grandzbee@gmail.com.",
      "acceptanceCriteria": [
        "The /admin access denied UI includes English text indicating that admin access is restricted to the Internet Identity linked to Google account grandzbee@gmail.com.",
        "No UI claims that direct Google OAuth login is supported; wording references Internet Identity and linking to the specified Google account."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/RequireAdmin.tsx",
          "operation": "modify",
          "description": "Update the Access Denied CardDescription (and any other visible copy in this screen) to explicitly state: users must sign in with Internet Identity, and only the Internet Identity linked to Google account grandzbee@gmail.com is permitted as admin; avoid any wording implying Google OAuth login. Continue to rely on the existing authorization flow via useIsAdmin (actor.isCallerAdmin) for gating. Use existing shadcn-ui Card/Button components already used on this screen. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}