{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "New project",
  "architectural_notes": [
    "Admin credential configuration depends on access-control role map; resetting credentials without resetting roles can create a circular lockout state."
  ],
  "known_issues": [
    "Admin credentials reset can leave no principal with admin role, causing a circular lockout where no user can configure new admin credentials; requires resetting both credentials and role map."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-update-the-frontend-initial-admin-setup-flow-to-use-the-new-backend-initial-setup-api-instead-of-the-current-workaround-that-throws-an-error-on-credentials-not-set-so-that-clicking-configure-admin-credentials-successfully-completes-setup-after-a-reset-and-stops-showing-the-circular-lockout-error-banner",
      "title": "Update the frontend initial admin setup flow to use the new backend initial-setup API (instead of the current workaround that throws an error on \"Credentials not set\"), so that clicking \"Configure Admin Credentials\" successfully completes setup after a reset and stops showing the circular-lockout error banner.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Implement a backend canister upgrade migration that fully resets admin configuration by (1) setting stored admin credentials to null and (2) clearing/removing all AccessControl role assignments so that no principal retains the admin role after the reset.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Add a backend API that allows re-initializing admin access after a reset: when admin credentials are currently not configured, allow an authenticated Internet Identity caller to set new initial admin username/password and become the first admin. This must be rejected if admin credentials already exist.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Fix admin reset lockout by resetting role map and enabling initial admin setup after reset",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}